restapi/controllers/UserProfileController.php

SELECT * FROM `user_profile`
---
    public function actionIndex(){

        $activeData = new ActiveDataProvider([
            'query' => \common\models\UserProfile::find(),
            'pagination' => [
                'pageSize' => 5,
            ],
        ]);